Revit 2024 API
OverrideGraphicSettings.IsCutForegroundPatternVisible Property
 The visibility of the cut face foreground fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool IsCutForegroundPatternVisible { get; }
Visual Basic
Public ReadOnly Property IsCutForegroundPatternVisible As Boolean
	Get
Visual C++
public:
property bool IsCutForegroundPatternVisible {
	bool get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace